// var names = [
// 	'张1', '张2', '张3', '张4', '张5', '张6', '张7', '张8', '张9', '张10',
// 	'张11', '张12', '张13', '张14', '张15', '张16', '张17', '张18', '张19', '张20',
// 	'张21', '张22', '张23', '张24', '张25', '张26', '张27', '张28', '张29', '张30',
// 	'张31', '张32', '张33', '张34', '张35', '张36', '张37', '张38', '张39', '张40',
// 	'张41', '张42', '张43', '张44', '张45', '张46', '张47', '张48', '张49', '张50',
// 	'张1', '张2', '张3', '张4', '张5', '张6', '张7', '张8', '张9', '张10',
// 	'张11', '张12', '张13', '张14', '张15', '张16', '张17', '张18', '张19', '张20',
// 	'张21', '张22', '张23', '张24', '张25', '张26', '张27', '张28', '张29', '张30',
// 	'张31', '张32', '张33', '张34', '张35', '张36', '张37', '张38', '张39', '张40',
// 	'张41', '张42', '张43', '张44', '张45', '张46', '张47', '张48', '张49', '张50',
// 	'张1', '张2', '张3', '张4', '张5', '张6', '张7', '张8', '张9', '张10',
// 	'张11', '张12', '张13', '张14', '张15', '张16', '张17', '张18', '张19', '张20',
// 	'张21', '张22', '张23', '张24', '张25', '张26', '张27', '张28', '张29', '张30',
// 	'张31', '张32', '张33', '张34', '张35', '张36', '张37', '张38', '张39', '张40',
// 	'张41', '张42', '张43', '张44', '张45', '张46', '张47', '张48', '张49', '张50',
// ];

var names = getNumbers(160);

// var namesNo = ['010', '020', '030', '040','050','060','070','080'];
// var namesBlack = ['090', '100', '110', '120', '130','140','150','160'];

var namesNo = ['',''];
var namesBlack = ['',''];



function getNumbers(n) {
	var arr = [];
	for (var i = 0; i < n; i++) {
		arr.push(i);
	}
	return arr;
}

function deleteArr(arr, arrEle) {
	if (typeof arrEle === 'string' || typeof arrEle === 'number') {
		var temp = [];
		temp.push(arrEle);
		arrEle = temp;
	}
	if (arrEle.length === 0) {
		return arr;
	}
	var arrOut = [];
	var flag = 0;
	for (var i = 0, j = arr.length; i < j; i++) {
		flag = 0;
		for (var m = 0, n = arrEle.length; m < n; m++) {
			if (arr[i] !== arrEle[m]) {
				flag++;
			}
		}
		if (flag === n) {
			arrOut.push(arr[i]);
		}
	}
	return arrOut;
}